GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k22.inc
#define DACR2                            BANKMASK(VREFCON2), 2, b
#define DACR3                            BANKMASK(VREFCON2), 3, b
#define DACR4                            BANKMASK(VREFCON2), 4, b
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, a
#define DC2B1                            BANKMASK(CCP2CON), 5, a
#define DC3B0                            BANKMASK(CCP3CON), 4, b
#define DC3B1                            BANKMASK(CCP3CON), 5, b
#define DC4B0                            BANKMASK(CCP4CON), 4, b
#define DC4B1                            BANKMASK(CCP4CON), 5, b
#define DC5B0                            BANKMASK(CCP5CON), 4, b
#define DC5B1                            BANKMASK(CCP5CON), 5, b
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT                               BANKMASK(PORTC), 7, a
#define DT1                              BANKMASK(PORTC), 7, a
#define DT2                              BANKMASK(PORTD), 7, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, a
#define ECCPAS0                          BANKMASK(ECCP1AS), 4, a
#define ECCPAS1                          BANKMASK(ECCP1AS), 5, a
#define ECCPAS2                          BANKMASK(ECCP1AS), 6, a
#define ECCPASE                          BANKMASK(ECCP1AS), 7, a
#define EDG1POL                          BANKMASK(CTMUCONL), 4, b
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, b
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, b
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, b
#define EDG2POL                          BANKMASK(CTMUCONL), 7, b
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, b
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, b
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, b
#define EDGEN                            BANKMASK(CTMUCONH), 3, b
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, b
#define EEADR0                           BANKMASK(EEADR), 0, a
#define EEADR1                           BANKMASK(EEADR), 1, a
#define EEADR2                           BANKMASK(EEADR), 2, a
#define EEADR3                           BANKMASK(EEADR), 3, a
#define EEADR4                           BANKMASK(EEADR), 4, a
#define EEADR5                           BANKMASK(EEADR), 5, a
#define EEADR6                           BANKMASK(EEADR), 6, a
#define EEADR7                           BANKMASK(EEADR), 7, a
#define EEADR8                           BANKMASK(EEADRH), 0, a
#define EEADR9                           BANKMASK(EEADRH), 1, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EMBMD                            BANKMASK(PMD1), 0, b
#define EVPOL0                           BANKMASK(CM1CON0), 3, a
#define EVPOL01                          BANKMASK(CM1CON0), 3, a
#define EVPOL02                          BANKMASK(CM2CON0), 3, a
#define EVPOL1                           BANKMASK(CM1CON0), 4, a
#define EVPOL11                          BANKMASK(CM1CON0), 4, a
#define EVPOL12                          BANKMASK(CM2CON0), 4, a
#define FERR1                            BANKMASK(RCSTA1), 2, a
#define FERR2                            BANKMASK(RCSTA2), 2, a
#define FLT0                             BANKMASK(PORTB), 0, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FVREN                            BANKMASK(VREFCON0), 7, b
#define FVRS0                            BANKMASK(VREFCON0), 4, b
#define FVRS1                            BANKMASK(VREFCON0), 5, b
#define FVRST                            BANKMASK(VREFCON0), 6, b
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFIOFS                           BANKMASK(OSCCON), 2, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIN                           BANKMASK(PORTA), 5, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSP1STAT), 5, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, a
#define I2C_READ                         BANKMASK(SSP1STAT), 2, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, a
#define I2C_START                        BANKMASK(SSP1STAT), 3, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, a
#define I2C_STOP                         BANKMASK(SSP1STAT), 4, a
#define I2C_STOP2                        BANKMASK(SSP2STAT), 4, a
#define IDISSEN                          BANKMASK(CTMUCONH), 1, b
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOCB4                            BANKMASK(IOCB), 4, a
#define IOCB5                            BANKMASK(IOCB), 5, a
#define IOCB6                            BANKMASK(IOCB), 6, a
#define IOCB7                            BANKMASK(IOCB), 7, a
#define IOFS                             BANKMASK(OSCCON), 2, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, b
#define IRNG1                            BANKMASK(CTMUICON), 1, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, b
#define ITRIM1                           BANKMASK(CTMUICON), 3, b
#define ITRIM2                           BANKMASK(CTMUICON), 4, b
#define ITRIM3                           BANKMASK(CTMUICON), 5, b
#define ITRIM4                           BANKMASK(CTMUICON), 6, b
#define ITRIM5                           BANKMASK(CTMUICON), 7, b
#define IVRST                            BANKMASK(HLVDCON), 5, a
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LFIOFS                           BANKMASK(OSCCON2), 0, a
#define LVDEN                            BANKMASK(HLVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(HLVDCON), 0, a
#define LVDL1                            BANKMASK(HLVDCON), 1, a
#define LVDL2                            BANKMASK(HLVDCON), 2, a
#define LVDL3                            BANKMASK(HLVDCON), 3, a
#define LVV0                             BANKMASK(HLVDCON), 0, a
#define LVV1                             BANKMASK(HLVDCON), 1, a
#define LVV2                             BANKMASK(HLVDCON), 2, a
#define LVV3                             BANKMASK(HLVDCON), 3, a
#define MC1OUT                           BANKMASK(CM2CON1), 7, a
#define MC2OUT                           BANKMASK(CM2CON1), 6, a
#define MCLR                             BANKMASK(PORTE), 3, a
#define MFIOFS                           BANKMASK(OSCCON2), 1, a
#define MFIOSEL                          BANKMASK(OSCCON2), 4, a
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, a
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, a
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, a
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, a
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, a
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, a
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, a
#define MSSP1MD                          BANKMASK(PMD1), 6, b
#define MSSP2MD                          BANKMASK(PMD1), 7, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_A2                           BANKMASK(SSP2STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_MCLR                         BANKMASK(PORTE), 3, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS                           BANKMASK(PORTA), 5, a
#define NOT_SS1                          BANKMASK(PORTA), 5, a
#define NOT_SS2                          BANKMASK(PORTD), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_W2                           BANKMASK(SSP2STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, a
#define NVCFG0                           BANKMASK(ADCON1), 0, a
#define NVCFG1                           BANKMASK(ADCON1), 1, a
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1A                              BANKMASK(PORTC), 2, a
#define P1B                              BANKMASK(PORTD), 5, a
#define P1C                              BANKMASK(PORTD), 6, a
#define P1D                              BANKMASK(PORTD), 7, a
#define P1DC0                            BANKMASK(PWM1CON), 0, a
#define P1DC1                            BANKMASK(PWM1CON), 1, a
#define P1DC2                            BANKMASK(PWM1CON), 2, a
#define P1DC3                            BANKMASK(PWM1CON), 3, a
#define P1DC4                            BANKMASK(PWM1CON), 4, a
#define P1DC5                            BANKMASK(PWM1CON), 5, a
#define P1DC6                            BANKMASK(PWM1CON), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(PWM1CON), 7, a
#define P1SSAC0                          BANKMASK(ECCP1AS), 2, a
#define P1SSAC1                          BANKMASK(ECCP1AS), 3, a
#define P1SSBD0                          BANKMASK(ECCP1AS), 0, a
#define P1SSBD1                          BANKMASK(ECCP1AS), 1, a
#define P2                               BANKMASK(SSP2STAT), 4, a
#define P2C                              BANKMASK(PORTD), 3, a
#define P2D                              BANKMASK(PORTD), 4, a
#define P2DC0                            BANKMASK(PWM2CON), 0, a
#define P2DC02                           BANKMASK(PSTR2CON), 0, a
#define P2DC0CON                         BANKMASK(PSTR2CON), 0, a
#define P2DC1                            BANKMASK(PWM2CON), 1, a
#define P2DC12                           BANKMASK(PSTR2CON), 1, a
#define P2DC1CON                         BANKMASK(PSTR2CON), 1, a
#define P2DC2                            BANKMASK(PWM2CON), 2, a
#define P2DC22                           BANKMASK(PSTR2CON), 2, a
#define P2DC2CON                         BANKMASK(PSTR2CON), 2, a
#define P2DC3                            BANKMASK(PWM2CON), 3, a
#define P2DC32                           BANKMASK(PSTR2CON), 3, a
#define P2DC3CON                         BANKMASK(PSTR2CON), 3, a
#define P2DC4                            BANKMASK(PWM2CON), 4, a
#define P2DC42                           BANKMASK(PSTR2CON), 4, a
#define P2DC4CON                         BANKMASK(PSTR2CON), 4, a
#define P2DC5                            BANKMASK(PWM2CON), 5, a
#define P2DC6                            BANKMASK(PWM2CON), 6, a
#define P2M0                             BANKMASK(CCP2CON), 6, a
#define P2M1                             BANKMASK(CCP2CON), 7, a
#define P2RSEN                           BANKMASK(PWM2CON), 7, a
#define P2SSAC0                          BANKMASK(ECCP2AS), 2, a
#define P2SSAC1                          BANKMASK(ECCP2AS), 3, a
#define P2SSBD0                          BANKMASK(ECCP2AS), 0, a
#define P2SSBD1                          BANKMASK(ECCP2AS), 1, a
#define P3B                              BANKMASK(PORTE), 1, a
#define P3DC0                            BANKMASK(PWM3CON), 0, b
#define P3DC1                            BANKMASK(PWM3CON), 1, b
#define P3DC2                            BANKMASK(PWM3CON), 2, b
#define P3DC3                            BANKMASK(PWM3CON), 3, b
#define P3DC4                            BANKMASK(PWM3CON), 4, b
#define P3DC5                            BANKMASK(PWM3CON), 5, b
#define P3DC6                            BANKMASK(PWM3CON), 6, b
#define P3M0                             BANKMASK(CCP3CON), 6, b
#define P3M1                             BANKMASK(CCP3CON), 7, b
#define P3RSEN                           BANKMASK(PWM3CON), 7, b
#define P3SSAC0                          BANKMASK(ECCP3AS), 2, b
#define P3SSAC1                          BANKMASK(ECCP3AS), 3, b
#define P3SSBD0                          BANKMASK(ECCP3AS), 0, b
#define P3SSBD1                          BANKMASK(ECCP3AS), 1, b
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PDC0                             BANKMASK(PWM1CON), 0, a
#define PDC1                             BANKMASK(PWM1CON), 1, a
#define PDC2                             BANKMASK(PWM1CON), 2, a
#define PDC3                             BANKMASK(PWM1CON), 3, a
#define PDC4                             BANKMASK(PWM1CON), 4, a
#define PDC5                             BANKMASK(PWM1CON), 5, a
#define PDC6                             BANKMASK(PWM1CON), 6, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PLLRDY                           BANKMASK(OSCCON2), 7, a
#define POR                              BANKMASK(RCON), 1, a
#define PRISD                            BANKMASK(OSCCON2), 2, a
#define PRSEN                            BANKMASK(PWM1CON), 7, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
